app/Controllers/Dashboard.php

    public function index()
    {
        $turnamenModel = new TurnamenModel();
        $timModel = new TimModel();
        $jadwalModel = new JadwalModel();

        $data = [
            'title' => 'Dashboard',
            'total_turnamen' => count($turnamenModel->findAll()),
---
SELECT *
FROM `turnamen`