app/Controllers/Jadwal.php

    public function tambah()
    {
        $peran = session()->get('peran');
        if (!in_array($peran, ['Admin', 'AdminGame'])) {
            return redirect()->to('dashboard')->with('error', 'Akses ditolak.');
        }

        $turnamenModel = new TurnamenModel();
        $timModel = new TimModel();

        $data['turnamen'] = $turnamenModel->findAll();
---
SELECT *
FROM `turnamen`