app/Controllers/Turnamen.php

    public function index()
    {
        $peran = session()->get('peran');
        if (!in_array($peran, ['Admin', 'AdminGame'])) {
            return redirect()->to('dashboard')->with('error', 'Akses ditolak.');
        }

        $model = new TurnamenModel();
        // Join game table to get nama_game
        $data['turnamen'] = $model->select('turnamen.*, game.nama_game as game')
                                  ->join('game', 'game.id_game = turnamen.id_game', 'left')
                                  ->findAll();
---
SELECT `turnamen`.*, `game`.`nama_game` as `game`
FROM `turnamen`
LEFT JOIN `game` ON `game`.`id_game` = `turnamen`.`id_game`