app/Models/JadwalModel.php

SELECT `jadwal`.*, `turnamen`.`nama_turnamen`, `game`.`nama_game` as `game`, `tim1`.`nama_tim` as `nama_tim_1`, `tim2`.`nama_tim` as `nama_tim_2`, `skor`.`skor_tim_1`, `skor`.`skor_tim_2`
FROM `jadwal`
JOIN `turnamen` ON `turnamen`.`id_turnamen` = `jadwal`.`id_turnamen`
LEFT JOIN `game` ON `game`.`id_game` = `turnamen`.`id_game`
JOIN `tim` as `tim1` ON `tim1`.`id_tim` = `jadwal`.`id_tim_1`
JOIN `tim` as `tim2` ON `tim2`.`id_tim` = `jadwal`.`id_tim_2`
LEFT JOIN `skor` ON `skor`.`id_jadwal` = `jadwal`.`id_jadwal`
---
    public function getJadwalWithDetail()
    {
        return $this->select('jadwal.*, turnamen.nama_turnamen, game.nama_game as game, tim1.nama_tim as nama_tim_1, tim2.nama_tim as nama_tim_2, skor.skor_tim_1, skor.skor_tim_2')
                    ->join('turnamen', 'turnamen.id_turnamen = jadwal.id_turnamen')
                    ->join('game', 'game.id_game = turnamen.id_game', 'left')
                    ->join('tim as tim1', 'tim1.id_tim = jadwal.id_tim_1')
                    ->join('tim as tim2', 'tim2.id_tim = jadwal.id_tim_2')
                    ->join('skor', 'skor.id_jadwal = jadwal.id_jadwal', 'left')
                    ->findAll();

SELECT `jadwal`.*, `turnamen`.`nama_turnamen`, `game`.`nama_game` as `game`, `tim1`.`nama_tim` as `nama_tim_1`, `tim2`.`nama_tim` as `nama_tim_2`
FROM `jadwal`
JOIN `turnamen` ON `turnamen`.`id_turnamen` = `jadwal`.`id_turnamen`
LEFT JOIN `game` ON `game`.`id_game` = `turnamen`.`id_game`
JOIN `tim` as `tim1` ON `tim1`.`id_tim` = `jadwal`.`id_tim_1`
JOIN `tim` as `tim2` ON `tim2`.`id_tim` = `jadwal`.`id_tim_2`
WHERE `jadwal_tanding` LIKE '%2026-05-19%' ESCAPE '!'
---
    public function getJadwalHariIni()
    {
        $today = date('Y-m-d');
        return $this->select('jadwal.*, turnamen.nama_turnamen, game.nama_game as game, tim1.nama_tim as nama_tim_1, tim2.nama_tim as nama_tim_2')
                    ->join('turnamen', 'turnamen.id_turnamen = jadwal.id_turnamen')
                    ->join('game', 'game.id_game = turnamen.id_game', 'left')
                    ->join('tim as tim1', 'tim1.id_tim = jadwal.id_tim_1')
                    ->join('tim as tim2', 'tim2.id_tim = jadwal.id_tim_2')
                    ->like('jadwal_tanding', $today)
                    ->findAll();