app/Models/SkorModel.php

    public function getSkorWithDetail()
    {
        return $this->select('skor.*, jadwal.jadwal_tanding, jadwal.babak, turnamen.nama_turnamen, tim1.nama_tim as nama_tim_1, tim2.nama_tim as nama_tim_2, tim_pemenang.nama_tim as pemenang')
                    ->join('jadwal', 'jadwal.id_jadwal = skor.id_jadwal')
                    ->join('turnamen', 'turnamen.id_turnamen = jadwal.id_turnamen')
                    ->join('tim as tim1', 'tim1.id_tim = jadwal.id_tim_1')
                    ->join('tim as tim2', 'tim2.id_tim = jadwal.id_tim_2')
                    ->join('tim as tim_pemenang', 'tim_pemenang.id_tim = skor.id_tim_pemenang', 'left')
                    ->findAll();
---
SELECT `skor`.*, `jadwal`.`jadwal_tanding`, `jadwal`.`babak`, `turnamen`.`nama_turnamen`, `tim1`.`nama_tim` as `nama_tim_1`, `tim2`.`nama_tim` as `nama_tim_2`, `tim_pemenang`.`nama_tim` as `pemenang`
FROM `skor`
JOIN `jadwal` ON `jadwal`.`id_jadwal` = `skor`.`id_jadwal`
JOIN `turnamen` ON `turnamen`.`id_turnamen` = `jadwal`.`id_turnamen`
JOIN `tim` as `tim1` ON `tim1`.`id_tim` = `jadwal`.`id_tim_1`
JOIN `tim` as `tim2` ON `tim2`.`id_tim` = `jadwal`.`id_tim_2`
LEFT JOIN `tim` as `tim_pemenang` ON `tim_pemenang`.`id_tim` = `skor`.`id_tim_pemenang`