app/Models/TurnamenModel.php

SELECT *
FROM `turnamen`
WHERE `status` != 'Selesai'
---
    public function getTurnamenAktif()
    {
        return $this->where('status !=', 'Selesai')->findAll();